Revit 2024 API
DetailElementOrderUtils.GetDrawOrderForDetails Method
 Returns the given detail elements according to the currently specified draw order for the detail elements in a given view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static IList<ElementId> GetDrawOrderForDetails(
	View view,
	ISet<ElementId> detailIdsToSort
)
Visual Basic
Public Shared Function GetDrawOrderForDetails ( _
	view As View, _
	detailIdsToSort As ISet(Of ElementId) _
) As IList(Of ElementId)
Visual C++
public:
static IList<ElementId^>^ GetDrawOrderForDetails(
	View^ view,
	ISet<ElementId^>^ detailIdsToSort
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view in which the details appear.
detailIdsToSort
Type: System.Collections.Generic.ISet<ElementId>
 The detail to be sorted by draw order.
Return Value
 The detail ids sorted from back to front, with earlier elements drawing first and appearing under later elements.
Remarks
 The sort order is from back to front, with earlier elements drawing first and appearing under later elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The document does not support detail draw order. Only projects and 3d families support draw order. 2d families and in-place families do not support draw order. -or- detailIdsToSort is empty or it contains elements are not visible in the view. -or- detailIdsToSort is empty or it contains elements that do not participate in detail draw ordering. Details must be visible in the view.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace